       FD BIBLE-DATA-META.
       01 BIBLE-DATA-META-RECORD.
           05 BIBLE-DATA-META-KEY    PIC X(12).
           05 BIBLE-DATA-META-VALUE  PIC X(250).
