       FD WORDLIST-FILE.
       01 WORDLIST-RECORD.
           05 WORDLIST-INDEX    PIC 9(7).
           05 WORDLIST-WORD     PIC X(77).
           05 WORDLIST-COUNTER      PIC 9(7).
