       FD WORDLIST-META-FILE.
       01 WORDLIST-META-RECORD.
           05 WORDLIST-META-KEY    PIC X(12).
           05 WORDLIST-META-VALUE  PIC X(250).
