       FD WORDLIST-FILE.
       01 WORDLIST-RECORD.
           05 WORDLIST-ID.
               10 WORDLIST-INDEX    PIC 9(7)
               10 WORDLIST-WORD     PIC X(77)
           05 WORDLIST-COUNTER      PIC 9(7)
