       IDENTIFICATION DIVISION.
       PROGRAM-ID. readTranslation.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "readTranslation."
           EXIT PROGRAM.
           END PROGRAM readTranslation.
