       IDENTIFICATION DIVISION.
           PROGRAM-ID. sqliteToDatafile.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BIBLE-TEXT-FILE ASSIGN TO WS-TRANSLATION-NAME-TXT
             ORGANIZATION IS LINE SEQUENTIAL
             ACCESS MODE IS SEQUENTIAL.
           SELECT BIBLE-DATA-META ASSIGN TO WS-TRANSLATION-NAME-META
             ORGANIZATION IS INDEXED
             ACCESS MODE IS RANDOM
             RECORD KEY IS BIBLE-DATA-META-KEY.
           SELECT BIBLE-DATA-FILE ASSIGN TO WS-TRANSLATION-NAME-DATA
             ORGANIZATION IS INDEXED
             ACCESS MODE IS RANDOM
             RECORD KEY IS BIBLE-DATA-ID.
       DATA DIVISION.
       FILE SECTION.
       FD BIBLE-TEXT-FILE.
       01 BIBLE-TEXT-RECORD         PIC X(777).
       FD BIBLE-DATA-META.
       01 BIBLE-DATA-META-RECORD.
           05 BIBLE-DATA-META-KEY    PIC X(12).
           05 BIBLE-DATA-META-VALUE  PIC X(250).
       FD BIBLE-DATA-FILE.
       01 BIBLE-DATA-RECORD.
           05 BIBLE-DATA-ID.
               10 BIBLE-DATA-BOOK    PIC 9(3).
               10 BIBLE-DATA-CHAPTER PIC 9(3).
               10 BIBLE-DATA-VERSE   PIC 9(3).
           05 BIBLE-DATA-TEXT        PIC X(500).
           88 BIBLE-DATA-EOF         VALUE HIGH-VALUE.
       WORKING-STORAGE SECTION.
       01 WS-TRANSLATION-NAME       PIC X(250).
       01 WS-TRANSLATION-NAME-TXT   PIC X(250).
       01 WS-TRANSLATION-NAME-DATA  PIC X(250).
       01 WS-COMMAND                PIC X(250).
       01 WS-BIBLE-TEXT-EOF         PIC X VALUE "N".
       01 WS-BIBLE-TEXT-LANGUAGE    PIC X(50).
       01 WS-BIBLE-TEXT-TRANSLATION PIC X(10).
       01 WS-BIBLE-TEXT-BOOK        PIC 9(3).
       01 WS-BIBLE-TEXT-CHAPTER     PIC 9(3).
       01 WS-BIBLE-TEXT-VERSE       PIC 9(3).
       01 WS-BIBLE-TEXT-TEXT        PIC X(500).
       LINKAGE SECTION.
       01 SQLITE-DB-FILENAME PIC X(250).
       01 SQLITE-DB-FILEPATH PIC X(250).
       PROCEDURE DIVISION USING
         SQLITE-DB-FILENAME,
         SQLITE-DB-FILEPATH.
       SQLITETODATAFILE.
           UNSTRING SQLITE-DB-FILENAME
             DELIMITED BY "." INTO WS-TRANSLATION-NAME.

           MOVE FUNCTION concatenate(
             FUNCTION trim(WS-TRANSLATION-NAME),
             ".txt.tmp"
           ) TO WS-TRANSLATION-NAME-TXT

           MOVE FUNCTION concatenate(
             FUNCTION trim(WS-TRANSLATION-NAME),
             ".meta.tmp"
           ) TO WS-TRANSLATION-NAME-META

           MOVE FUNCTION concatenate(
             FUNCTION trim(WS-TRANSLATION-NAME),
             ".data.tmp"
           ) TO WS-TRANSLATION-NAME-DATA

           CALL "SYSTEM"
             USING FUNCTION concatenate(
                "python scripts/mysword.py -p ",
                SQLITE-DB-FILEPATH,
                " > ",
                WS-TRANSLATION-NAME-TXT
           )
           PERFORM RUNBIBLETEXTFILE
           EXIT PROGRAM.
       SQLITETODATAFILE-EXIT.

       RUNBIBLETEXTFILE.
           MOVE "N" TO WS-BIBLE-TEXT-EOF
           OPEN INPUT BIBLE-TEXT-FILE
           PERFORM UNTIL WS-BIBLE-TEXT-EOF = "Y"
               READ BIBLE-TEXT-FILE
                   AT END
                       MOVE "Y" TO WS-BIBLE-TEXT-EOF
                   NOT AT END
                       PERFORM ROWBIBLETEXTFILE
           END-PERFORM
           CLOSE BIBLE-TEXT-FILE
           CONTINUE.
       RUNBIBLETEXTFILE-EXIT.

       ROWBIBLETEXTFILE.
           UNSTRING BIBLE-TEXT-RECORD
               DELIMITED BY "###" INTO
                 WS-BIBLE-TEXT-LANGUAGE,
                 WS-BIBLE-TEXT-TRANSLATION,
                 WS-BIBLE-TEXT-BOOK,
                 WS-BIBLE-TEXT-CHAPTER,
                 WS-BIBLE-TEXT-VERSE,
                 WS-BIBLE-TEXT-TEXT
           DISPLAY WS-BIBLE-TEXT-BOOK
           DISPLAY WS-BIBLE-TEXT-CHAPTER
           DISPLAY WS-BIBLE-TEXT-VERSE
           CONTINUE.
       ROWBIBLETEXTFILE-EXIT.
